In [33]:
import pandas as pd

In [34]:
accounts_dict = {
    'account_id': [3,2,8,6],
    'income': [108939, 12747, 87709, 91796]
}

accounts = pd.DataFrame(accounts_dict)
accounts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   account_id  4 non-null      int64
 1   income      4 non-null      int64
dtypes: int64(2)
memory usage: 192.0 bytes

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are

- Low Salary: All the salaries are strictly less than 20000
- Average Salary: All the salaries in the inclusive range (20000, 50000)
- High Salary: All the salaries are strictly greater than 50000

- The result table must contain all three categories. If there are no accounts in a category, return 0.

In [35]:
def find_category(n):
    if n<20000:
        return 'Low Salary'
    elif (n>=20000) & (n<=50000):
        return 'Average Salary'
    else:
        return 'High Salary'

apply(find_category): This applies the find_category function to each element in the accounts['income'] Series

assign(category=...): This adds a new column named category to the DataFrame with the results of the apply method

In [36]:
accounts_category = accounts.assign(category=accounts['income'].apply(find_category))

accounts_category

   account_id  income     category
0           3  108939  High Salary
1           2   12747   Low Salary
2           8   87709  High Salary
3           6   91796  High Salary

Grouping and Counting: accounts\['category'].value_counts() groups by the category column and counts the number of rows in each group

Reindexing: .reindex(\['Low', 'Average', 'High'], fill_value=0) ensures that all specified categories are present in the result. If a category is missing, it fills the count with 0

Reset Index: reset_index() converts the Series back to a DataFrame

Renaming Columns: columns = \['category', 'count'] renames the columns to match the desired output format

In [37]:
all_categories = ['Low Salary', 'Average Salary', 'High Salary']

accounts_category['category'].value_counts().reindex(all_categories, fill_value=0).reset_index().rename(columns={'count':'accounts_count'})

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3